{"keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_3", "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "layers": [{"class_name": "InputLayer", "name": "decoder_input", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 1], "name": "decoder_input"}}, {"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 100], "name": "input_1"}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 100], "name": "input_2"}}, {"class_name": "CuDNNLSTM", "name": "decoder1", "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "decoder1", "trainable": true, "go_backwards": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 100, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "return_state": true, "stateful": false}}, {"class_name": "Dense", "name": "regressor", "inbound_nodes": [[["decoder1", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "regressor"}}], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]]}}