{"keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_2", "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "layers": [{"class_name": "InputLayer", "name": "wave_input", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 1], "name": "wave_input"}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["wave_input", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "seed": null}}, {"class_name": "CuDNNLSTM", "name": "encoder1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "encoder1", "trainable": true, "go_backwards": false, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 100, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "return_state": true, "stateful": false}}], "input_layers": [["wave_input", 0, 0]]}}