{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "decoder_input", "config": {"batch_input_shape": [null, null, 1], "name": "decoder_input", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 100], "name": "input_1", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [null, 100], "name": "input_2", "dtype": "float32", "sparse": false}}, {"class_name": "CuDNNLSTM", "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "name": "decoder1", "config": {"name": "decoder1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "stateful": false, "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "bias_regularizer": null, "return_state": true, "recurrent_constraint": null, "unit_forget_bias": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"class_name": "Dense", "inbound_nodes": [[["decoder1", 0, 0, {}]]], "name": "regressor", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "name": "regressor", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}}], "name": "model_3", "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.3"}