{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "wave_input", "config": {"batch_input_shape": [null, null, 1], "name": "wave_input", "dtype": "float32", "sparse": false}}, {"class_name": "Dropout", "inbound_nodes": [[["wave_input", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "CuDNNLSTM", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "encoder1", "config": {"name": "encoder1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "return_sequences": true, "activity_regularizer": null, "stateful": false, "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "bias_regularizer": null, "return_state": true, "recurrent_constraint": null, "unit_forget_bias": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}], "name": "model_2", "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "input_layers": [["wave_input", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.3"}