{"backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "dtype": "float32", "name": "dense_1", "units": 100, "batch_input_shape": [null, 17], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}]}