{"config": [{"config": {"units": 100, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "batch_input_shape": [null, 17], "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "dtype": "float32", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 3, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}