{"class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "dtype": "float32", "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 100, "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 17]}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 3, "bias_constraint": null, "activity_regularizer": null}}], "backend": "tensorflow"}