{"keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "activation": "relu", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "batch_input_shape": [null, 601], "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null}}], "backend": "tensorflow"}