{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "activation": "linear", "units": 100, "bias_regularizer": null, "batch_input_shape": [null, 17], "bias_constraint": null, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_2", "activation": "linear", "units": 3, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}]}