{"backend": "tensorflow", "config": [{"config": {"name": "dense_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "batch_input_shape": [null, 3001]}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 128}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 3}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3"}