{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 151], "activity_regularizer": null, "activation": "relu", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 128, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 128, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 3, "bias_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.3"}