{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 201], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "units": 128, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "units": 128, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "units": 3, "bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential"}