{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3", "config": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 128, "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 151]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "units": 128, "bias_regularizer": null, "name": "dense_2", "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "units": 3, "bias_regularizer": null, "name": "dense_3", "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}