{"class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "batch_input_shape": [null, 3001], "bias_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}], "backend": "tensorflow"}