{"keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activation": "relu", "dtype": "float32", "units": 600, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, 451]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.5, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "units": 600, "name": "dense_2", "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "rate": 0.5, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "units": 3, "name": "dense_3", "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}], "backend": "tensorflow"}