{"keras_version": "2.1.3", "config": [{"config": {"kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "units": 100, "activity_regularizer": null, "batch_input_shape": [null, 17], "activation": "linear", "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "units": 100, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "dense_3", "bias_regularizer": null, "use_bias": true, "units": 3, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}