{"config": {"input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_3", "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "layers": [{"name": "decoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "name": "decoder_input", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "input_2", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "decoder1", "class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "name": "decoder1", "recurrent_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "go_backwards": false, "return_state": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "units": 100, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}, "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "regressor", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "regressor", "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}, "inbound_nodes": [[["decoder1", 0, 0, {}]]]}]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}