{"config": {"input_layers": [["wave_input", 0, 0]], "name": "model_2", "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "layers": [{"name": "wave_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "name": "wave_input", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1", "seed": null, "noise_shape": null}, "inbound_nodes": [[["wave_input", 0, 0, {}]]]}, {"name": "encoder1", "class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "name": "encoder1", "recurrent_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "go_backwards": false, "return_state": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "units": 100, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}