{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.3", "config": {"layers": [{"config": {"batch_input_shape": [null, null, 1], "sparse": false, "name": "wave_input", "dtype": "float32"}, "class_name": "InputLayer", "name": "wave_input", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, null, 1], "sparse": false, "name": "decoder_input", "dtype": "float32"}, "class_name": "InputLayer", "name": "decoder_input", "inbound_nodes": []}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["wave_input", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "trainable": true, "return_state": true, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "return_sequences": true, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "encoder1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activity_regularizer": null}, "class_name": "CuDNNLSTM", "name": "encoder1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "trainable": true, "return_state": true, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "return_sequences": true, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "decoder1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activity_regularizer": null}, "class_name": "CuDNNLSTM", "name": "decoder1", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["encoder1", 0, 1, {}], ["encoder1", 0, 2, {}]]]}, {"config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "regressor", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "regressor", "inbound_nodes": [[["decoder1", 0, 0, {}]]]}], "input_layers": [["wave_input", 0, 0], ["decoder_input", 0, 0]], "output_layers": [["regressor", 0, 0]], "name": "model_1"}}