{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "sparse": false, "name": "decoder_input"}, "name": "decoder_input", "class_name": "InputLayer"}, {"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100], "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100], "sparse": false, "name": "input_2"}, "name": "input_2", "class_name": "InputLayer"}, {"inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"name": "decoder1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "stateful": false, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 100, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "return_state": true, "return_sequences": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null}, "name": "decoder1", "class_name": "CuDNNLSTM"}, {"inbound_nodes": [[["decoder1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_regularizer": null, "name": "regressor", "units": 1}, "name": "regressor", "class_name": "Dense"}], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_3", "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]]}, "keras_version": "2.1.3", "class_name": "Model"}