{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "sparse": false, "name": "wave_input"}, "name": "wave_input", "class_name": "InputLayer"}, {"inbound_nodes": [[["wave_input", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "seed": null, "name": "dropout_1"}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"name": "encoder1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "stateful": false, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 100, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "return_state": true, "return_sequences": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null}, "name": "encoder1", "class_name": "CuDNNLSTM"}], "input_layers": [["wave_input", 0, 0]], "name": "model_2", "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]]}, "keras_version": "2.1.3", "class_name": "Model"}