{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 600], "trainable": true, "activation": "linear", "units": 386, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 386, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "linear"}}], "keras_version": "2.1.3"}