{"config": [{"config": {"name": "dense_1", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1024, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "batch_input_shape": [null, 600]}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1024, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 20, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}