{"backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "units": 1024, "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 600], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "units": 1024, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "units": 1024, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "units": 20, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "linear"}}], "class_name": "Sequential", "keras_version": "2.1.3"}