{"config": [{"config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 600], "dtype": "float32", "name": "dense_1", "bias_regularizer": null, "units": 1024, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "units": 1024, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_3", "bias_regularizer": null, "units": 20, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_3"}, "class_name": "Activation"}], "keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow"}