{"config": [{"config": {"units": 1024, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 600], "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 1, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}