{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 1], "name": "decoder_input"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "decoder_input"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100], "name": "input_2"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "return_state": true, "units": 100, "go_backwards": false, "recurrent_constraint": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "stateful": false, "name": "decoder1", "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "kernel_constraint": null, "return_sequences": true}, "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "class_name": "CuDNNLSTM", "name": "decoder1"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "regressor", "activity_regularizer": null, "activation": "linear", "use_bias": true, "units": 1, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["decoder1", 0, 0, {}]]], "class_name": "Dense", "name": "regressor"}], "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_3"}, "keras_version": "2.1.3", "class_name": "Model"}