{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 1], "name": "wave_input"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "wave_input"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_1", "seed": null}, "inbound_nodes": [[["wave_input", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "return_state": true, "units": 100, "go_backwards": false, "recurrent_constraint": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "stateful": false, "name": "encoder1", "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "kernel_constraint": null, "return_sequences": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "CuDNNLSTM", "name": "encoder1"}], "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "input_layers": [["wave_input", 0, 0]], "name": "model_2"}, "keras_version": "2.1.3", "class_name": "Model"}