{"config": {"output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_3", "layers": [{"config": {"batch_input_shape": [null, null, 1], "sparse": false, "dtype": "float32", "name": "decoder_input"}, "class_name": "InputLayer", "name": "decoder_input", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 100], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 100], "sparse": false, "dtype": "float32", "name": "input_2"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"return_state": true, "stateful": false, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "return_sequences": true, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "unit_forget_bias": true, "name": "decoder1", "recurrent_constraint": null}, "class_name": "CuDNNLSTM", "name": "decoder1", "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"config": {"units": 1, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "use_bias": true, "name": "regressor"}, "class_name": "Dense", "name": "regressor", "inbound_nodes": [[["decoder1", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.1.3", "backend": "tensorflow"}