{"config": {"output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "input_layers": [["wave_input", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, null, 1], "sparse": false, "dtype": "float32", "name": "wave_input"}, "class_name": "InputLayer", "name": "wave_input", "inbound_nodes": []}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["wave_input", 0, 0, {}]]]}, {"config": {"return_state": true, "stateful": false, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "return_sequences": true, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "unit_forget_bias": true, "name": "encoder1", "recurrent_constraint": null}, "class_name": "CuDNNLSTM", "name": "encoder1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.1.3", "backend": "tensorflow"}