{"config": {"output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "layers": [{"config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "name": "decoder_input"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "decoder_input"}, {"config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"go_backwards": false, "kernel_constraint": null, "return_state": true, "return_sequences": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "name": "decoder1", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "bias_constraint": null, "bias_regularizer": null, "stateful": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "units": 100}, "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "class_name": "CuDNNLSTM", "name": "decoder1"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "regressor", "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}}, "inbound_nodes": [[["decoder1", 0, 0, {}]]], "class_name": "Dense", "name": "regressor"}], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_3"}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}