{"config": {"output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "layers": [{"config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "name": "wave_input"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "wave_input"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null}, "inbound_nodes": [[["wave_input", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"go_backwards": false, "kernel_constraint": null, "return_state": true, "return_sequences": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "name": "encoder1", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "bias_constraint": null, "bias_regularizer": null, "stateful": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "units": 100}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "CuDNNLSTM", "name": "encoder1"}], "input_layers": [["wave_input", 0, 0]], "name": "model_2"}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}