{"config": {"output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_3", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, 1], "sparse": false, "name": "decoder_input", "dtype": "float32"}, "name": "decoder_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 100], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 100], "sparse": false, "name": "input_2", "dtype": "float32"}, "name": "input_2"}, {"class_name": "CuDNNLSTM", "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 100, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "return_state": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "return_sequences": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "activity_regularizer": null, "unit_forget_bias": true, "name": "decoder1"}, "name": "decoder1"}, {"class_name": "Dense", "inbound_nodes": [[["decoder1", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "regressor"}, "name": "regressor"}]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}