{"config": {"output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "input_layers": [["wave_input", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, 1], "sparse": false, "name": "wave_input", "dtype": "float32"}, "name": "wave_input"}, {"class_name": "Dropout", "inbound_nodes": [[["wave_input", 0, 0, {}]]], "config": {"rate": 0.5, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "CuDNNLSTM", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 100, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "return_state": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "return_sequences": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "activity_regularizer": null, "unit_forget_bias": true, "name": "encoder1"}, "name": "encoder1"}]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}