{"backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Model", "config": {"layers": [{"config": {"sparse": false, "dtype": "float32", "name": "wave_input", "batch_input_shape": [null, null, 1]}, "inbound_nodes": [], "name": "wave_input", "class_name": "InputLayer"}, {"config": {"sparse": false, "dtype": "float32", "name": "decoder_input", "batch_input_shape": [null, null, 1]}, "inbound_nodes": [], "name": "decoder_input", "class_name": "InputLayer"}, {"config": {"go_backwards": false, "bias_constraint": null, "trainable": true, "return_state": true, "units": 64, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_regularizer": null, "name": "encoder1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["wave_input", 0, 0, {}]]], "name": "encoder1", "class_name": "CuDNNLSTM"}, {"config": {"go_backwards": false, "bias_constraint": null, "trainable": true, "return_state": true, "units": 64, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_regularizer": null, "name": "decoder1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["decoder_input", 0, 0, {}], ["encoder1", 0, 1, {}], ["encoder1", 0, 2, {}]]], "name": "decoder1", "class_name": "CuDNNLSTM"}, {"config": {"bias_constraint": null, "name": "regressor", "units": 1, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_constraint": null}, "inbound_nodes": [[["decoder1", 0, 0, {}]]], "name": "regressor", "class_name": "Dense"}], "input_layers": [["wave_input", 0, 0], ["decoder_input", 0, 0]], "name": "model_1", "output_layers": [["regressor", 0, 0]]}}