{"backend": "tensorflow", "keras_version": "2.1.3", "config": {"name": "model_3", "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "layers": [{"name": "decoder_input", "inbound_nodes": [], "config": {"dtype": "float32", "name": "decoder_input", "sparse": false, "batch_input_shape": [null, null, 1]}, "class_name": "InputLayer"}, {"name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 100]}, "class_name": "InputLayer"}, {"name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 100]}, "class_name": "InputLayer"}, {"name": "decoder1", "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "go_backwards": false, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "return_state": true, "stateful": false, "bias_regularizer": null, "units": 100, "recurrent_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "return_sequences": true, "kernel_constraint": null}, "class_name": "CuDNNLSTM"}, {"name": "regressor", "inbound_nodes": [[["decoder1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "regressor", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Model"}