{"backend": "tensorflow", "keras_version": "2.1.3", "config": {"name": "model_2", "input_layers": [["wave_input", 0, 0]], "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "layers": [{"name": "wave_input", "inbound_nodes": [], "config": {"dtype": "float32", "name": "wave_input", "sparse": false, "batch_input_shape": [null, null, 1]}, "class_name": "InputLayer"}, {"name": "dropout_1", "inbound_nodes": [[["wave_input", 0, 0, {}]]], "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"name": "encoder1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "encoder1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "go_backwards": false, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "return_state": true, "stateful": false, "bias_regularizer": null, "units": 100, "recurrent_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "return_sequences": true, "kernel_constraint": null}, "class_name": "CuDNNLSTM"}]}, "class_name": "Model"}