{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "sparse": false, "name": "decoder_input"}, "inbound_nodes": [], "name": "decoder_input", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 100], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 100], "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "trainable": true, "go_backwards": false, "bias_constraint": null, "return_state": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "return_sequences": true, "name": "decoder1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "unit_forget_bias": true}, "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "name": "decoder1", "class_name": "CuDNNLSTM"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "name": "regressor", "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["decoder1", 0, 0, {}]]], "name": "regressor", "class_name": "Dense"}], "output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "name": "model_3", "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.3"}