{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "sparse": false, "name": "wave_input"}, "inbound_nodes": [], "name": "wave_input", "class_name": "InputLayer"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1"}, "inbound_nodes": [[["wave_input", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "go_backwards": false, "bias_constraint": null, "return_state": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "return_sequences": true, "name": "encoder1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "unit_forget_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "encoder1", "class_name": "CuDNNLSTM"}], "output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "name": "model_2", "input_layers": [["wave_input", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.3"}