{"config": {"output_layers": [["regressor", 0, 0], ["decoder1", 0, 1], ["decoder1", 0, 2]], "name": "model_3", "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 1], "name": "decoder_input"}, "inbound_nodes": [], "name": "decoder_input", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100], "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100], "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "bias_regularizer": null, "name": "decoder1", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "stateful": false, "kernel_constraint": null, "return_state": true, "trainable": true, "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 100, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["decoder_input", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "name": "decoder1", "class_name": "CuDNNLSTM"}, {"config": {"trainable": true, "activation": "linear", "bias_regularizer": null, "name": "regressor", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 1, "activity_regularizer": null}, "inbound_nodes": [[["decoder1", 0, 0, {}]]], "name": "regressor", "class_name": "Dense"}], "input_layers": [["decoder_input", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Model"}