{"config": {"output_layers": [["encoder1", 0, 1], ["encoder1", 0, 2]], "name": "model_2", "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 1], "name": "wave_input"}, "inbound_nodes": [], "name": "wave_input", "class_name": "InputLayer"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_1"}, "inbound_nodes": [[["wave_input", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "bias_regularizer": null, "name": "encoder1", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "stateful": false, "kernel_constraint": null, "return_state": true, "trainable": true, "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 100, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "encoder1", "class_name": "CuDNNLSTM"}], "input_layers": [["wave_input", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Model"}